retrostore/app/Models/ProdutosModel.php

    public function getProduto($id = null){
        if ($id == null){
            return $this->findAll();
        }
        return $this->asArray()->where(['id' => $id])->first();
---
SELECT *
FROM `produto`
SELECT *
FROM `produto`
WHERE `id` = '10'
 LIMIT 1